Revit 2026 API

# StoneStonePattern Property

---

The property labeled "Relief Pattern" from the "Stone" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string StonePattern { get; }
```
```vb
Public Shared ReadOnly Property StonePattern As String
	Get
```
```cpp
public:
static property String^ StonePattern {
	String^ get ();
}
```
```fsharp
static member StonePattern : string with get
```

#### Property Value

String

This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "StonePatternType".

#### Reference

Stone Class

Autodesk.Revit.DB.Visual Namespace